SunCity/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <attributes>
    <name>ПредставлениеШтрихкода</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>Characteristic.ТипыШтрихкодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
      <types>CatalogRef.Справки2ЕГАИС</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШтрихкода</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыШтрихкодов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>Адрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/ТипыИнформационныхКарт/ТипыИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИнформационныхКарт</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Дисконтная</name>
  </enumValues>
  <enumValues>
    <name>Регистрационная</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Catalogs/ИнформационныеКарты/ИнформационныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеКарты</name>
  <comment>(Упр) Магнитные и штриховые карты.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КодКарты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>EnumRef.ТипыИнформационныхКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующегоОпроса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БонуснаяПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.БонусныеПрограммыЛояльности</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаДляНакоплений</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаВладельцаКартыПоШаблону</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбратныйНомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SunCity/src/CommonModules/ШтрихкодированиеРТ/Module.bsl
Процедура НайтиДисконтнуюКарту(
	Форма,
	СтруктураПараметров,
	Штрихкод,
	РежимПоискаКарты,
	НеизвестныеДанныеПО,
	НайденоОбъектов) Экспорт
	
	ЗапросПоиска 	 = Новый Запрос;
	
	Если РежимПоискаКарты = "НомерТелефона" Тогда
		
		ЗапросПоиска.Текст = ИнформационныеКартыВызовСервера.ТекстЗапросаПоискаКарты(1);
		ЗапросПоиска.УстановитьПараметр("ВведенноеЧисло", Штрихкод);
		ЗапросПоиска.УстановитьПараметр("ВведенноеЧислоСВосьмеркой", "8" + Сред(Штрихкод, 2));
		
	ИначеЕсли РежимПоискаКарты = "ФИО" Тогда
		
		ЗапросПоиска.Текст = ИнформационныеКартыВызовСервера.ТекстЗапросаПоискаКарты(2);
		ЗапросПоиска.УстановитьПараметр("Наименование", "%" + Штрихкод + "%");
		
		ТипыИнформации = Новый Массив;
		ТипыИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		ТипыИнформации.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		ЗапросПоиска.УстановитьПараметр("ТипыИнформации", ТипыИнформации);
		
	ИначеЕсли РежимПоискаКарты = "Email" Тогда
		
		ЗапросПоиска.Текст = ИнформационныеКартыВызовСервера.ТекстЗапросаПоискаКарты(3);
		ЗапросПоиска.УстановитьПараметр("АдресЭП", "%" + Штрихкод + "%");
		
	Иначе
		
		ЗапросПоиска.Текст = ИнформационныеКартыВызовСервера.ТекстЗапросаПоискаКарты(0);
		ЗапросПоиска.УстановитьПараметр("ВводимоеЧисло", ШтрихКод);
		
	КонецЕсли;
	
	ЗапросПоиска.УстановитьПараметр("ТипКарты", Перечисления.ТипыИнформационныхКарт.Дисконтная);
	
	Выборка = ЗапросПоиска.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Телефон = "";
		АдресЭП	= "";
		
		Если РежимПоискаКарты = "НомерТелефона" Тогда
			
			ШтрихКод 	= Выборка.НомерТелефона;
			Телефон 	= ШтрихкодированиеРТКлиентСервер.ПодготовитьТелефон(Выборка.НомерТелефона);
			
		ИначеЕсли РежимПоискаКарты = "Email" Тогда
			
			ШтрихКод = Выборка.АдресЭП;
			АдресЭП	 = Выборка.АдресЭП;

		Иначе
			
			ШтрихКод = Штрихкод;
			
		КонецЕсли;
		
		
		СтруктураШтрихкода = Новый Структура;
		СтруктураШтрихкода.Вставить("ДанныеПО", 		Штрихкод);
		СтруктураШтрихкода.Вставить("Штрихкод", 		Штрихкод);
		СтруктураШтрихкода.Вставить("НомерТелефона", 	Телефон);
		СтруктураШтрихкода.Вставить("АдресЭП", 			АдресЭП);
		
		СтруктураШтрихкода.Вставить("МагнитныйКод", "");
		СтруктураШтрихкода.Вставить("Количество", 	1);

		СтруктураШтрихкода.Вставить("Карта", 					Выборка.Ссылка);
		СтруктураШтрихкода.Вставить("ТипКарты", 				Перечисления.ТипыИнформационныхКарт.Дисконтная);
		СтруктураШтрихкода.Вставить("ВладелецКарты", 			Выборка.Ссылка.ВладелецКарты);
		СтруктураШтрихкода.Вставить("ЭтоРегистрационнаяКарта", 	Ложь);
		
		СтруктураПараметров.ЗначенияПоиска.Добавить(СтруктураШтрихкода);
		СтруктураПараметров.Вставить("НомерТелефона", 	Телефон);
		СтруктураПараметров.Вставить("АдресЭП", 			АдресЭП);
		
	КонецЦикла;
	
	НайденоОбъектов = Выборка.Количество();
	
	Если НайденоОбъектов <> 0 Тогда
		НеизвестныеДанныеПО = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ТелефоныДисконтнойКартыПоДаннымШК(ДисконтнаяКарта) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокТелефонов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Карты.Ссылка КАК Ссылка,
	|	Карты.КодКарты КАК ШтрихКод
	|ИЗ
	|	Справочник.ИнформационныеКарты КАК Карты
	|ГДЕ
	|	Карты.Ссылка = &ДисконтнаяКарта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Штрихкоды.Владелец,
	|	Штрихкоды.Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Владелец = &ДисконтнаяКарта
	|
	|УПОРЯДОЧИТЬ ПО
	|	Штрихкод";
	
	Запрос.УстановитьПараметр("ДисконтнаяКарта", ДисконтнаяКарта);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		
		Если ШтрихкодированиеРТКлиентСервер.ТелефонКорректен(ВыборкаЗапроса.ШтрихКод) Тогда
						
			Телефон 		= ШтрихкодированиеРТКлиентСервер.ПодготовитьТелефон(ВыборкаЗапроса.ШтрихКод);
			ТелефонСтрокой 	= "";
			
			ПодключаемоеОборудованиеРТ.ПреобразоватьТелефонКПользовательскомуВиду(Телефон, ТелефонСтрокой);
			
			СписокТелефонов.Добавить(Телефон, ТелефонСтрокой);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокТелефонов;
	
КонецФункции
